** E.g
#+BEGIN_SRC js
  const Box = x =>
        ({
          map: f => Box(f(x)),    // just to be able to keep chaining
          fold: f => f(x),
          inspect: () => `Box(${x})`,
        });

  const nextCharForNumberString = str =>
        Box(str)
        .map(s => s.trim())
        .map(r => new Number(r))
        .map(i => i + 1)
        .map(i => String.fromCharCode(i))
        .fold(c => c.toLowerCase());

  const result = nextCharForNumberString(' 64');

  console.log(result);
#+END_SRC

#+RESULTS:
: a
: undefined

** E.g
#+BEGIN_SRC js
const Box = x =>
      ({
        map: f => Box(f(x)),
        fold: f => f(x),
        inspect: () => `Box(${x})`,
      });

const moneyToFloat = str =>
      Box(str)
      .map(s => s.replace(/\$/g, ''))
      .map(r => parseFloat(r));

const percentToFloat = str =>
      Box(str.replace(/\%/g, ''))
      .map(replaced => parseFloat(replaced))
      .map(number => number * 0.01);

const applyDiscount = (price, discount) =>
      moneyToFloat(price)
      .fold(cost =>
            percentToFloa(discount)
            .fold(savings =>
                  cost - cost * savings));

const result = applyDiscount('$5.00', '20%');

console.log(result);
#+END_SRC

#+RESULTS:
: 4
: undefined

*** e.g. 1
#+BEGIN_SRC js

const Right = x =>
      ({
        map: f => Right(f(x)),
        fold: (f, g) => g(x),
        inspect: () => `Right(${x})`,
      });

const Left = x =>
      ({
        map: f => Left(x),
        fold: (f, g) => f(x),
        inspect: () => `Left(${x})`,
      });


const result = Right(2)
      .map(x => x + 1)
      .map(x => x / 2)
      .fold(x => 'error', x => x)

console.log(result);
#+END_SRC

#+RESULTS:
: 1.5
: undefined
*** e.g 2
#+BEGIN_SRC js
// const Either = Right || Left;

const Right = x =>
      ({
        map: f => Right(f(x)),
        fold: (f, g) => g(x),
        inspect: () => `Right(${x})`,
      });

const Left = x =>
      ({
        map: f => Left(x),
        fold: (f, g) => f(x),
        inspect: () => `Left(${x})`,
      });


const fromNullable = x =>
      x != null ? Right(x) : Left(x);

const findColor = name =>
      fromNullable({red: '#ff4444', blue: '#3b6998', yellow: '#fff68f'}[name]);

console.log(
  findColor('jellow')
    .map(x => x.slice(1))
    .map(x => x.toUpperCase())
    .fold(x => 'no color', x => x)
);

#+END_SRC

#+RESULTS:
: no color
: undefined
*** e.g 1
#+BEGIN_SRC js
const fs = require('fs');

const Right = x =>
      ({
        chain: f => f(x),
        map: f => Right(f(x)),
        fold: (f, g) => g(x),
        inspect: () => `Right(${x})`,
      });

const Left = x =>
      ({
        chain: f => Left(x),
        map: f => Left(x),
        fold: (f, g) => f(x),
        inspect: () => `Left(${x})`,
      });


const tryCatch = f => {
  try {

    return Right(f());
  } catch (e) {
    console.log(e.message);
    return Left(e)
  }
};

const getPort = () =>
      tryCatch(() => fs.readFileSync('./config.json'))
      .chain(c => tryCatch(() => JSON.parse(c))) // we already have a Right ot Left so we use chain
      .fold(e => 3000,          // in case of error it'll be 3000
            c => c.port);       // if everything went fine

const result = getPort();

console.log(result);

#+END_SRC

#+RESULTS:
: ENOENT: no such file or directory, open './config.json'
: 3000
: undefined
